Repository: eliot488995568/docs
Catalog: src/locale/*/LC_MESSAGES/developer/nodes-system/node_type_fields.po
Languages: fr_fr

source: Node-type fields
fr_fr: Champs de type de nœud

source: Roadiz can handle many types of node-type fields. Here is a complete list:
fr_fr: Roadiz peut gérer de nombreux champs de type de nœud. Voici une liste complète :

source: *Title*, *meta-title*, *meta-description* and *keywords* are always available since they are stored directly inside ``NodesSources`` entity. Then you will be sure to always have a *title* no matter the node-type you are using.
fr_fr: *Titre*, *méta-title*, *méta-description* et *mots clés* sont toujours disponibles puisqu'ils sont stockés directement dans l'entité ``NodesSources``. Vous serez sûr d'avoir toujours un *titre* quel que soit le type de nœud que vous utilisez.

source: Simple data
fr_fr: Données simples

source: This following fields stores simple data in your custom node-source database table.
fr_fr: Les champs suivants stockent des données simples dans votre table de base de données de nœuds.

source: Single-line text
fr_fr: Chaîne de caractères

source: Date and time
fr_fr: Date et heure

source: Basic text
fr_fr: Texte basic

source: Markdown text
fr_fr: Texte Markdown

source: Boolean
fr_fr: Booléen

source: Integer number
fr_fr: Nombre entier

source: Decimal number
fr_fr: Nombre décimal

source: Color
fr_fr: Couleur

source: Single geographic coordinates
fr_fr: Coordonnées géographiques uniques

source: CSS code
fr_fr: Code CSS

source: Country code (ISO 3166-1 alpha-2)
fr_fr: Code pays (ISO 3166-1 alpha-2)

source: YAML code
fr_fr: Code YAML

source: Many to many join
fr_fr: Jointure Many to many

source: Many to one join
fr_fr: Jointure Many to One

source: Single relationship using a provider
fr_fr: Relation unique en utilisant un Provider

source: Multiple relationship using a provider
fr_fr: Relation multiple en utilisant un Provider

source: Custom collection
fr_fr: Collection personnalisée

source: *Single geographic coordinates* field stores its data in JSON format. Make sure you don’t have manually written data in its input field.
fr_fr: Le champ *coordonnées géographiques uniques* stocke ses données au format JSON. Assurez-vous que vous n'avez pas de données déjà inscrite à la main dans la base de donnée.

source: To use *Single geographic coordinates* you must create a *Google API Console* account with *Maps API v3* activated. Then, create a *Browser key* and paste it in “Google Client ID” parameter in Roadiz settings to enable *geographic* node-type fields. If you didn't do it, a simple text input will be display instead of *Roadiz Map Widget*.
fr_fr: Pour utiliser les *coordonnées géographiques uniques*, vous devez créer un compte *Google API Console* avec *Maps API v3* activé. Ensuite, créez une *clé de navigateur* et collez-la dans le paramètre “Google Client ID” dans les paramètres Roadiz pour activer les champs de type de nœud *géographique*. Si vous ne l'avez pas fait, une simple entrée de texte sera affichée au lieu de *Widget Roadiz*.

source: Virtual data
fr_fr: Données virtuelles

source: Virtual types do not really store data in node-source table. They display custom widgets in your editing page to link documents, nodes or custom-forms with your node-source.
fr_fr: Les types virtuels ne stockent pas vraiment les données dans la table node-source. Ils affichent des widgets personnalisés dans votre page d'édition pour lier des documents, des nœuds ou des formulaires personnalisés à votre node-source.

source: Nodes references
fr_fr: Références de nœuds

source: Custom form
fr_fr: Formulaires personnalisés

source: Complex data
fr_fr: Données complexes

source: These fields types must be created with *default values* (comma separated) in order to display available default choices for “select-box” types:
fr_fr: Ces types de champs doivent être créés avec des *valeurs par défaut* (séparées par des virgules) afin de les afficher sous la forme d'une “boîte de sélection”:

source: Single choice
fr_fr: Choix simple

source: Multiple choices
fr_fr: Choix multiple

source: Children nodes
fr_fr: Nœuds enfants

source: *Children node* field type is a special virtual field that will display a custom node-tree inside your editing page. You can add *quick-create* buttons by listing your node-types names in *default values* input, comma separated.
fr_fr: Le type de champ *Nœuds enfant* est un champ virtuel spécial qui affichera une arborescence personnalisée à l'intérieur de votre page. Vous pouvez ajouter des boutons *création rapide* en listant les noms de vos types de nœuds dans les *valeurs par défaut*.

source: Universal fields
fr_fr: Champs universels

source: If you need a field to hold exactly the same data for all translations, you can set it as *universal*. For example for documents, numeric and boolean data that do not change from one language to another.
fr_fr: Si vous avez besoin que votre champ contienne exactement les mêmes données pour toutes les traductions, vous pouvez le définir comme *universel*. Par exemple, pour les documents, les données numéraires et booléennes qui ne changent pas d'une langue à une autre.

source: It will duplicate data at each save time from default translation to others. It will also hide the edit field from non-default translation to avoid confusion.
fr_fr: Cela va dupliquer les données à chaque fois depuis la traduction par défaut vers les autres pour vous faire gagnez du temps. Cela masquera également les champs d'édition sur les autres traductions pour éviter toute confusion lors du remplissage.

source: YAML field
fr_fr: Champ YAML

source: When you use YAML field type, you get an additional method to return your code already parsed. If your field is named ``data``, your methods will be generated in your *NSEntity* as ``getData()`` and ``getDataAsObject()``.
fr_fr: Lorsque vous utilisez le type de champ YAML, vous obtenez une méthode supplémentaire pour retourner votre code déjà analysé. Si votre champ est nommé ``data``, vos méthodes seront générées dans votre *NSEntity* en tant que ``getData()`` et ``getDataAsObject()``.

source: ``getData()`` method will return your YAML code as *string*.
fr_fr: La méthode ``getData()`` retournera votre code YAML en tant que *string*.

source: ``getDataAsObject()`` will return a mixed data,array or ``stdObject`` according to your code formatting. This method will throw a ``\Symfony\Component\Yaml\Exception\ParseException`` if your YAML code is not valid.
fr_fr: ``getDataAsObject()`` retournera des données mixtes, un tableau ou un ``stdObject`` selon le formatage de votre code. Cette méthode peut lancer une ``\Symfony\Component\Yaml\Exception\ParseException`` si votre code YAML n'est pas valide.

source: Many to many and Many to one joins
fr_fr: Jointures Many to Many et Many to One

source: You can create custom relations between your node-source and whatever Doctrine entities in *Roadiz* or in your theme.
fr_fr: Vous pouvez créer des relations personnalisées entre votre source et toutes les entités Doctrine disponible dans *Roadiz* ou dans votre thème.

source: You must fill the *default values* field for these two types.
fr_fr: Vous devez remplir le champ *valeurs par défaut* pour ces deux types.

source: Single and multiple provider
fr_fr: Provider simple et multiple

source: The generic provider type allow you to fetch every data you want through a ``Provider`` class in your theme. This can be really useful if you need to fetch items from an external API and to reference them in your nodes-sources.
fr_fr: Le type de Provider générique vous permet de récupérer toutes les données que vous voulez à travers une classe ``Provider`` depuis votre thème. Cela peut être très utile si vous avez besoin de récupérer des éléments depuis une API externe et de les référencer dans vos nodes-sources.

source: Imagine that you want to link your page with an *Instagram* post. You’ll have to create a class that extends ``Themes\Rozier\Explorer\AbstractExplorerProvider`` and configure it in your field:
fr_fr: Imaginez que vous voulez lier votre page avec un post *Instagram*. Vous devrez créer une classe qui hérite de ``Themes\Rozier\Explorer\AbstractExplorerProvider`` et la configurer dans votre champ:

source: This provider will implement ``getItems``, ``getItemsById`` and other methods from ``ExplorerProviderInterface`` in order to be able to display your *Instagram* posts in Roadiz explorer widget and to find your selected items back. Each *Instagram* post will be wrapped in a ``Themes\Rozier\Explorer\AbstractExplorerItem`` that will map your custom data to the right fields to be showed in Roadiz back-office.
fr_fr: Ce Provider va implémenter ``getItems``, ``getItemsById`` et d'autres méthodes de ``ExplorerProviderInterface`` afin de pouvoir afficher vos posts *Instagram* dans le widget Roadiz et retrouver les éléments sélectionnés. Chaque post *Instagram* sera encapsulé dans un ``Themes\Rozier\Explorer\AbstractExplorerItem`` qui exposera vos données personnalisées de la bonne manière pour être affichées dans le back-office de Roadiz.

source: You’ll find an implementation example in Roadiz with ``Themes\Rozier\Explorer\SettingsProvider`` and ``Themes\Rozier\Explorer\SettingExplorerItem``. These classes do not fetch data from an API but from your database using ``EntityListManager``.
fr_fr: Vous trouverez un exemple d'implémentation dans Roadiz avec ``Themes\Rozier\Explorer\SettingsProvider`` et ``Themes\Rozier\Explorer\SettingExplorerItem``. Ces classes ne récupèrent pas les données d'une API mais de votre base de données en utilisant ``EntityListManager``.

source: Single and multiple provider types can accept additional options too. If you want to make your provider configurable at runtime you can pass ``options`` in your field configuration.
fr_fr: Les types de Provider simple et multiple peuvent également accepter des options supplémentaires. Si vous voulez rendre votre provider configurable à l'exécution, vous pouvez passer des ``options`` dans la configuration de votre champ.

source: Then you must override your provider’ ``configureOptions`` method to add which options are allowed.
fr_fr: Ensuite, vous devez remplacer la méthode ``configureOptions`` de votre Provider pour définir quelles options sont autorisées.

source: Last but not least, you can create a custom collection field to store read-only data using a dedicated *Symfony* ``AbstractType``.
fr_fr: Enfin, vous pouvez créer une collection de champs personnalisée pour y stocker des données en lecture seule en utilisant un ``AbstractType`` *Symfony* personnalisé.

source: You must fill the *default values* field for this type:
fr_fr: Vous devez remplir le champ *valeurs par défaut* pour ce type.

source: You must understand that *custom collection* data will be stored as JSON array in your database. So you won’t be able to query your node-source using this data.
fr_fr: Veuillez noter que les données de *collection personnalisée* seront stockées en tant que tableau JSON dans votre base de données. Vous ne pourrez donc pas interroger votre source de noeud en utilisant ces données ou créer de filtres.

source: In your ``FooBarType``, you’ll be able to use *Symfony* standard fields types and **Roadiz** non-virtual fields too such as ``MarkdownType``, ``JsonType``, ``YamlType``.
fr_fr: Dans votre ``FooBarType``, vous pourrez utiliser des types de champs standards *Symfony* et des champs non-virtuels **Roadiz** tels que ``MarkdownType``, ``JsonType``, ``YamlType``.
