Repository: eliot488995568/docs
Catalog: src/locale/*/LC_MESSAGES/user/users/intro.po
Languages: fr_fr

source: Managing users
fr_fr: Gérer les utilisateurs

source: This is a simple guide on how to create and manage users using Roadiz CLI.
fr_fr: Il s'agit d'un guide simple sur la façon de créer et de gérer les utilisateurs en utilisant Roadiz CLI.

source: There are two ways of adding users, via the back-office and in command-line, both will be displayed in each section.
fr_fr: Il y a deux façons d'ajouter des utilisateurs, via le back-office et en ligne de commande.

source: When working with Roadiz in the back-office, you can easily manage users via the *User system* icon in the toolbar.
fr_fr: Lorsque vous travaillez dans le back-office de Roadiz, vous pouvez facilement gérer les utilisateurs via l'icône *Système utilisateur* dans la barre d'outils.

source: Create a new user
fr_fr: Créer un nouvel utilisateur

source: You can add users simply by clicking *Add an user* button.
fr_fr: Vous pouvez ajouter des utilisateurs en cliquant sur le bouton *Ajouter un utilisateur*.

source: If you create an user without specifying its *password*, an email with a password reset link will sent. Make sure that you entered the right email and that your Roadiz website has a *mailer* configured. New user will be locked unless he or she resets its password first.
fr_fr: Si vous créez un utilisateur sans spécifier son *mot de passe*, un email avec un lien de réinitialisation du mot de passe sera envoyé. Assurez-vous que vous avez entré le bon email et que votre site web Roadiz a un *mailer* configuré. Le nouvel utilisateur sera verrouillé à moins qu'il ne réinitialise son mot de passe d'abord.

source: A new user without password will stay locked until he or she resets its password.
fr_fr: Un nouvel utilisateur sans mot de passe aura son compte verrouillé jusqu'à ce qu'il réinitialise son mot de passe.

source: The command-line ``bin/console users:create loginname`` starts a new interactive user creation session. You will create a new user with login and email, you can also choose if it's a backend user and if it's a superadmin.
fr_fr: La ligne de commande ``bin/console users:create loginname`` démarre une nouvelle session interactive de création d'un utilisateur. Vous allez créer un nouvel utilisateur avec son nom d’utilisateur et son email, vous pouvez aussi choisir si il s’agit d’un utilisateur backend ou bien super-admin.

source: Delete user
fr_fr: Suppression d’un utilisateur

source: You can remove users by clicking the trashcan icon.
fr_fr: Vous pouvez supprimer des utilisateurs en cliquant sur l'icône de la corbeille.

source: The command ``bin/console users:delete loginname`` delete the user "loginname".
fr_fr: La commande ``bin/console users:delete loginname`` supprime l'utilisateur "loginname".

source: Adding role
fr_fr: Ajouter un rôle

source: You can edit a users profile the same way you edit a node-type. You can add roles in the *Roles* tab.
fr_fr: Vous pouvez modifier un profil utilisateur de la même manière que vous modifiez un type de nœud. Vous pouvez ajouter des rôles dans l'onglet *Roles*.

source: If you want to add ``ROLE_SUPERADMIN`` role to "test" user, it would look like this in command-line:
fr_fr: Si vous voulez ajouter le rôle ``ROLE_SUPERADMIN`` à l'utilisateur "test", il ressemblerait à cela en ligne de commande :

source: Other action
fr_fr: Autres actions

source: It is possible to enable or disable users with ``users:enable`` or ``users:disable`` command. If a user doesn't remember his password, you can regenerate it with the ``users:password`` command. For more informations and more actions, we invite you to check available commands with:
fr_fr: Il est possible d'activer ou de désactiver les utilisateurs avec la commande ``users:enable`` ou ``users:disable``. Si un utilisateur ne se souvient pas de son mot de passe, vous pouvez le régénérer avec la commande ``users:password``. Pour plus d'informations et plus d'actions, nous vous invitons à vérifier les commandes disponibles avec:

source: Enable SSO for back-office users
fr_fr: Activer le SSO pour les utilisateurs du back-office

source: Roadiz is compatible with any **OpenID** single sign-on system (such as Google, Exchange, …) and can be configured to allow your company users to login to your back-office with several ``ROLES``.
fr_fr: Roadiz est compatible avec la plupart des systèmes d’authentification centralisée (SSO) basés sur **OpenID** (Google, Exchange, …). Vous pouvez configurer votre CMS pour que chaque membre de votre organisation puisse s’y connecter avec les ``ROLES`` que vous aurez choisi au préalable.

source: First, make sure to generate and gather the following information from your *OpenID* provider:
fr_fr: Avant d’aller plus loin, vérifiez que vous avez bien à votre dispositions les information suivantes depuis votre fournisseur d’identité *OpenID* :

source: OpenID client ID
fr_fr: Client ID *OpenID*

source: OpenID client secret
fr_fr: Client secret *OpenID*

source: OpenID auto-discovery URL (i.e. for Google GSuite user https://accounts.google.com/.well-known/openid-configuration)
fr_fr: URL d’auto-découverte *OpenID* (ex : pour Google Suite https://accounts.google.com/.well-known/openid-configuration)

source: Then you should decide:
fr_fr: Puis vous devez déterminer :

source: What *roles* (comma separated) you want to be automatically granted to users connected with your SSO. You always can create a more complex strategy in your website by registering a ``RZ\Roadiz\OpenId\Authentication\Provider\JwtRoleStrategy``.
fr_fr: Quels *rôles* (séparés par virgule) vous souhaitez automatiquement assigner à vos utilisateurs connectés par SSO. Vous pouvez toujours développer une stratégie plus complexe pour votre site web en implémentant ``RZ\Roadiz\OpenId\Authentication\Provider\JwtRoleStrategy``.

source: What domain name to restrict users from. This is very important for *Google Suite* users because the auto-discovery is the same for everybody. You may not want to allow every Google Suite users to access your back-office 😉.
fr_fr: Quel nom de domaine utiliser pour restreindre les utilisateurs. C'est très important pour les utilisateurs de *Google Suite* car la configuration est la même pour tout les utilisateurs de ce service. Vous ne souhaitez pas autoriser tous les clients Google Suite à accéder à votre back-office 😉.

source: A button label for your back-office login page.
fr_fr: Un libellé de bouton pour la page de connexion de votre back-office.

source: Fill all your gathered information to the right *Roadiz* settings.
fr_fr: Remplissez toutes les informations collectées dans les paramètres de *Roadiz* correspondant.

source: Then, if your parameter are correct you should see your SSO connect button on *Roadiz* back-office login page. Pay attention that if your SSO users do not have sufficient permissions they may have a 403 error after being redirected from SSO flow.
fr_fr: Ensuite, si votre parametrage est correct, vous devriez voir votre bouton de connexion SSO sur la page de connexion du back-office *Roadiz*. Faites attention à ce que vos utilisateurs SSO aient les permissions suffisantes pour accéder au back-office, ils pourraient avoir une erreur 403 après avoir été redirigés depuis le flux SSO.

source: Google Suite OpenID implementation is described at https://developers.google.com/identity/protocols/oauth2/openid-connect#discovery
fr_fr: L'implémentation OpenID de Google Suite est décrite sur https://developers.google.com/identity/protocols/oauth2/openid-connect#discovery

source: First, create a new OAuth2 application on https://console.cloud.google.com/ and follow instructions at https://developers.google.com/identity/protocols/oauth2/openid-connect#getcredentials
fr_fr: Premièrement, créez une nouvelle application OAuth2 sur https://console.cloud.google.com/ et suivez les instructions sur https://developers.google.com/identity/protocols/oauth2/openid-connect#getcredentials
