Repository: eliot488995568/docs
Catalog: src/locale/*/LC_MESSAGES/developer/attributes/index.po
Languages: fr_fr

source: Attributes
fr_fr: Attributs

source: Attributes are entities meant to qualify features on other entities, such as *nodes*. The main difference between *tags* and *attributes* is that you can set a value for each attributed *node*.
fr_fr: Les attributs sont des entités destinées à qualifier des caractéristiques sur d'autres entités, telles que les *nœuds*. La différence principale entre les *tags* et les *attributs* est que vous pouvez définir une valeur pour chaque *noeud* attribué.

source: The attribute "Color" can be set to "red" for one node and set to "green" for an other one.
fr_fr: L'attribut "Color" peut être défini à "rouge" pour un noeud et défini à "vert" pour un autre.

source: Okay, but now what is the difference between *attributes* and node-type fields? Not so much because node-type fields describe your node' features too, but they are fixed and defined by the developer. Once your node-type fields are created, you have to implement your feature in your *Twig* templates, and translate it in your XLF files too.
fr_fr: Ok, mais maintenant quelle est la différence entre les champs *attributs* et node-type ? Il n'y en a pas tellement, parce que les champs de type de nœud décrivent également les caractéristiques de votre nœud, mais ils sont figés et définis par le développeur. Une fois vos champs de type de nœud créés, vous devez implémenter votre fonctionnalité dans vos gabarits *Twig* et le traduire dans vos fichiers XLF.

source: Attributes are meant to be created and added by editors so they can use them in your website lifecycle without needing any further development.
fr_fr: Les attributs sont destinés à être créés et ajoutés par les éditeurs afin qu'ils puissent les utiliser dans le cycle de vie de votre site sans avoir besoin de développement supplémentaire.

source: From the developer perspective, attributes are just a collection of entities to be displayed in a loop. Then your editor can create new ones and be sure they will be displayed without any additional development.
fr_fr: Du point de vue des développeurs, les attributs ne sont qu'une collection d'entités à afficher au sein d'une boucle. Ensuite, votre éditeur peut en créer de nouveaux et être sûr qu'ils seront affichés sans aucun développement supplémentaire.

source: If you grouped your attributes, you can use ``grouped_attributes`` filter instead:
fr_fr: Si vous avez regroupé vos attributs, vous pouvez utiliser le filtre ``grouped_attributes`` à la place :

source: Attributes types
fr_fr: Types d'attributs

source: *String*
fr_fr: *Chaîne de caractères*

source: *Date and time*
fr_fr: *Date et heure*

source: *Single choice*: choice among defined options in your attribute
fr_fr: *Choix simple* : choix parmi les options définies dans votre attribut

source: *Boolean*
fr_fr: *Booléen*

source: *Integer*
fr_fr: *Nombre entier*

source: *Decimal*
fr_fr: *Nombre décimal*

source: *Email*
fr_fr: *Adresse e-mail*

source: *Color*
fr_fr: *Couleur*

source: *Country*: ISO 2-letters country code
fr_fr: *Pays* : Code pays ISO 2 lettres

source: Add attributes to nodes
fr_fr: Ajouter des attributs aux nœuds

source: *Attribute* section is available for any node in any translations.
fr_fr: La section *Attribute* est disponible pour n'importe quel nœud pour chaque traduction.

source: Twig extension
fr_fr: Extension Twig

source: Several filters and tests are available to ease up templating with *attributes*:
fr_fr: Plusieurs filtres et tests sont disponibles pour faciliter le templating avec des *attributs* :

source: Filters
fr_fr: Filtres

source: ``attributes``: same as ``node_source_attributes()`` method, get all available attributes from a ``NodesSources``.
fr_fr: ``attributes``: identique à la méthode ``node_source_attributes()``, récupère tous les attributs disponibles depuis une ``NodesSources``.

source: ``grouped_attributes``: same as ``node_source_grouped_attributes()`` method, get all available attributes from a ``NodesSources`` and gather them into their **group**.
fr_fr: ``grouped_attributes`` : identique à la méthode ``node_source_grouped_attributes()``, récupère tous les attributs disponibles depuis une ``NodesSources`` et les récupère dans leur **groupe**.

source: ``attribute_label(translation)``: get attribute translated ``label`` or ``code`` if not translated.
fr_fr: ``attribute_label(translation)`` : récupère l'attribut traduit ``label`` ou ``code`` s'il n'est pas traduit.

source: ``attribute_group_label(translation)``: get attribute group translated ``name`` or ``canonicalName`` if not translated.
fr_fr: ``attribute_group_label(translation)`` : récupère le groupe d'attributs traduit ``name`` ou ``canonicalName`` s'il n'est pas traduit.
