Repository: eliot488995568/docs
Catalog: src/locale/*/LC_MESSAGES/user/nodes-system/managing-nodes.po
Languages: fr_fr

source: Managing nodes
fr_fr: Gérer les nœuds

source: Nodes are the most important part of Roadiz CMS. They are your content which can be shaped as you want according to your node-types definitions. A node can be a blog-post, a content page, a photo gallery, even a shop product. This is why we called it “Node”, it’s an abstract data container interconnected with other node in a tree.
fr_fr: Les nœuds sont l'élément le plus important du CMS Roadiz. Ils permettent la mise en forme de votre contenu telle que vous le souhaitez en fonction de la définition de vos types de nœuds. Un nœud peut être un post de blog, une page de contenu, une galerie photo, ou même un produit de l'e-boutique. Voilà pourquoi nous l'avons appelé "Nœud", c'est une unité de données abstraite et interconnectée avec le reste de votre arborescence.

source: Node-tree navigation
fr_fr: Navigation dans l'arborescence

source: Simple node-tree after installing Roadiz with *Default theme*.
fr_fr: Arborescence simple après installation de Roadiz avec le *Default theme*.

source: Contextual menu for *home* node.
fr_fr: Menu contextuel pour un nœud *Accueil*.

source: Each node has a place in your website, that’s why we chose to arrange your content in a tree-shaped way. It’s intuitive and it works the same as your computer files.
fr_fr: Chaque nœud a sa place dans votre site et c'est pourquoi nous avons choisi d'organiser votre contenu à travers une arborescence. C'est intuitif et cela fonctionne de la même manière que la gestion des fichiers de votre ordinateur.

source: To edit a node’ content, simply click on it.
fr_fr: Pour éditer le contenu d’un nœud, cliquez simplement dessus.

source: To move a node across your tree, drag & drop using its handle (round or rombus shape). You can drop a node after or before an other one. You can also drop inside just by moving your mouse a bit on the right, you should see the node shadow to shift right.
fr_fr: Pour déplacer un nœud dans votre arborescence, réalisez un "cliquer-déposer" grâce à la poignée (en forme de rond ou de losange). Vous pouvez déposer un nœud avant ou après un autre élément. Vous pouvez également le déposer à l'intérieur d'un autre nœud, en décalant légèrement votre souris vers la droite de ce dernier pour déplacer l'ombre du nœud à l’intérieur.

source: Other actions are available from each node’ contextual menu. Right click on the node or click on the arrow at the right when you pass your mouse over.
fr_fr: D'autres options sont disponibles à partir du menu contextuel de chaque nœud. Faites un clic-droit sur le nœud ou cliquez sur la flèche droite qui apparaît au survol.

source: Contextual menu actions
fr_fr: Actions des menus contextuels

source: *Add child node:* to create a content inside the current node.
fr_fr: *Ajouter un nœud enfant* : créer une zone de contenu à l'intérieur d'un nœud existant.

source: *Edit node:* links to the current node “edit content” page.
fr_fr: *Éditer* : renvoie à la page d'édition de contenu du nœud concerné.

source: *Move to first position:* to move a node at the first position inside its parent node.
fr_fr: *Déplacer en première position* : déplacer un nœud à la première position au sein de l'arborescence du nœud parent.

source: *Move to last position:* basically the same for the last position.
fr_fr: *Déplacer en dernière position* : déplacer en dernière position de l'arborescence du parent.

source: *Delete node:* to move current node to the trashcan. A confirmation page will be prompt before really deleting a node.
fr_fr: *Supprimer* : placera le nœud actuel dans la corbeille. Une fenêtre de confirmation s'ouvrira afin de supprimer un nœud. Le nœud n’est pas supprimé définitivement, il se retrouve dans la corbeille.

source: *Hide/Show:* Change a node’ visibility. A hidden node won’t be displayed in Urls and your website, even if you are an administrator.
fr_fr: *Cacher/Afficher* : Changer la visibilité d'un nœud. Un nœud caché ne sera pas indexé dans votre site et n'aura pas d'url, même si vous êtes connecté en tant qu'administrateur.

source: *Publish/Unpublish:* Change a node’ publication status. Unpublished nodes aren’t visible to anonymous visitors, but visible for back-office users using ``preview.php`` entry point.
fr_fr: *Publier/Dépublier* : Modifier le statut de publication d'un nœud. Les nœuds non publiés ne sont pas visibles par les visiteurs anonymes, mais sont accessibles aux utilisateurs du back-office utilisant le chemin d'accès ``preview.php``.

source: *Publish offspring:* Publish a node and all its children nodes recursively.
fr_fr: *Publier la descendance* : Publier un nœud et tous ses noeuds-enfants rattachés.

source: *Duplicate:* Copy all current node’ content and relationships into a new node.
fr_fr: *Dupliquer* : Copier l'intégralité du contenu et des interactions du nœud actuel dans un nouveau nœud.

source: Creating a node
fr_fr: Création d'un nœud

source: “Add node” button located at the top of your *node-tree*.
fr_fr: Le bouton *Ajouter un nœud* est situé en haut de votre *arborescence*.

source: “Add a *child* node” button, which is located at the top of each node’ contextual menu.
fr_fr: Le bouton "Ajouter un nœud *enfant*" est situé en haut de chaque menu contextuel d'un nœud.

source: To add a blank node to your node-tree, you will need to choose your location. In Roadiz you can add a content at the root of your tree or choose a “parent-node”. In both cases you will be asked to choose a *node-type* and a *node-name* before creating your node.
fr_fr: Pour ajouter un nœud vide à votre arborescence, vous devrez choisir son emplacement. À l'intérieur de Roadiz, vous pouvez ajouter un contenu à la racine de votre arbre ou choisir un "nœud-parent". Dans les deux cas, vous serez invité à choisir un *type* et un *nom* avant de créer votre nœud.

source: *Node name* is the global identifier for your node. It must be unique and won’t change from one translation to an other. It can be changed later except if your developer locked it up. *Node name* is usually used to build your pages URL.
fr_fr: Le *Nom du noeud* est l'identifiant global de votre nœud. Il doit être unique et ne changera pas d'une traduction à un autre. Il peut être modifié ultérieurement, sauf si votre développeur a verrouillé sa modification. Le *Nom du nœud* est utilisé pour construire les URL de vos pages, de manière générale.

source: *Node-type* defines what fields will be available in your content. Choose well as you won’t be able to change it later, you ’ll have to delete and recreate an other node.
fr_fr: Le *Type de nœud* définit les champs disponibles de votre contenu. Choisissez le bien car la modification ne sera pas possible ultérieurement, il vous faudra supprimer le nœud et en créer un nouveau en cas d'erreur.

source: Edit an existing node
fr_fr: Éditer un nœud existant

source: Node edition page is composed in several tabs.
fr_fr: La page d'édition du nœud est composée de plusieurs onglets.

source: :ref:`Node content <node-content-tab>`
fr_fr: :ref:`Contenus du nœud <node-content-tab>`

source: :ref:`Node parameters <node-parameters-tab>`
fr_fr: :ref:`Paramètres du nœud <node-parameters-tab>`

source: :ref:`Tags <node-tags-tab>`
fr_fr: :ref:`Étiquettes <node-tags-tab>`

source: :ref:`SEO <node-seo-tab>`
fr_fr: :ref:`Référencement <node-seo-tab>`

source: :ref:`Tree <node-tree-tab>`, if your node is set up as a :ref:`stack <side-actions-parameters>`
fr_fr: :ref:`Arborescence <node-tree-tab>`, si votre nœud est défini comme :ref:`conteneur (ou pile) <side-actions-parameters>`

source: Node content
fr_fr: Contenu d'un nœud

source: Contents tab is basically the main part where you will edit your node specific data, using node-type fields such as *text* fields, or *documents* fields, etc.
fr_fr: L'onglet contenu vous permettra de modifier les données spécifiques de votre nœud, en utilisant des champs-types tels que *texte* ou *documents*, etc.

source: This tab will display different content over translations depending on which fields are marked as *universal* or not.
fr_fr: Cet onglet affichera les différents contenus traduits du nœud en fonction des champs marqués *Universel* ou non.

source: Node parameters
fr_fr: Paramètres du nœud

source: Parameters are global data such as your *node name*. They are used for managing your node visibility according to each user role and node back-office’ settings. This section should not be used so often as parameters will be set once by your developer.
fr_fr: Les paramètres sont des données globales telles que votre *nom de nœud*. Ils sont utilisés pour gérer la visibilité de votre nœud en fonction des rôles de chaque utilisateur et des paramètres de chaque nœud. Cette section ne doit pas être utilisée de façon régulière puisque les paramètres sont fixés par votre développeur en amont pour correspondre à votre besoin.

source: *This tab will display the same content over translations.*
fr_fr: *Cet onglet affichera le même contenu sans importance de traduction.*

source: Side actions and parameters
fr_fr: Actions et paramètres secondaires

source: Additional parameters are available on the right action-menu. These parameters are node-wide, they will apply on each node translations.
fr_fr: Des paramètres supplémentaires sont disponibles sur le menu d’action à droite de votre écran. Ces paramètres s’applique au niveau du nœud et donc ils seront identiques pour chaque traduction.

source: **Visibility**: Hide or show current node (according to your theme)
fr_fr: **Visibilité** : Cache ou affiche le nœud actuel (en fonction du développement de votre thème)

source: **Hide children**: Switch current node to a **stack**, children nodes won’t appear in the global Node-Tree anymore. You will be able to add *Stack type* buttons in the :ref:`node parameters tab <node-parameters-tab>`.
fr_fr: **Cacher les enfants** : Transforme le nœud actuel en **conteneur (ou pile)**, les nœuds enfants n’apparaitront plus dans le panneau global d’arborescence. Vous pourrez ajouter des boutons d’ajout de *types de pile* dans :ref:`l’onglet des paramètres du nœud <node-parameters-tab>`.

source: **Lock status**: Prevent users to delete current node or rename it. You should switch it on if your rely on some nodes in your themes.
fr_fr: **Verrouillage** : Empêche les utilisateurs de supprimer le nœud actuel ou de le renommer. Vous devriez activer ce mode si le nœud actuel est requis dans la logique de votre thème.

source: **Forbid children**: Prevent users to create children nodes.
fr_fr: **Nœud stéril** : Empêche les utilisateurs de créer des nœuds enfants.

source: Tags
fr_fr: Étiquettes

source: SEO
fr_fr: Référencement

source: *This tab will display different content over translations.*
fr_fr: *Cet onglet affichera les contenus en fonction de chaque traduction.*

source: Tree
fr_fr: L'arborescence

source: When a node is defined as a :ref:`stack <side-actions-parameters>`, *Tree* becomes its default view. You can set the default ordering in the *Edit tab*. And node-types set as *publishable* will display their publication date before its name.
fr_fr: Quand un nœud est défini en tant que :ref:`conteneur (ou pile) <side-actions-parameters>`, son *arborescence* devient la vue (onglet) par défaut. Vous pouvez définir l’ordre par défaut d’affichage des nœuds enfants dans l’onglet *Paramètres*. De plus, si vous avez défini le *type de nœud* comme étant *publiable*, chaque nœud affichera sa date de publication avant son *titre*.

source: Tree view becomes very interesting if you have many many children nodes, when you have blog posts or portfolio projects for example.
fr_fr: La vue de l’arborescence devient très intéressante si vous possédez un très grand nombre de nœuds enfants. C’est le cas, par exemple, si vous construisez un site listant des articles de blog ou des projets pour un portfolio.

source: Then you can add *stack type* in *Edit tab* to make some handy quick-add buttons to this view.
fr_fr: Enfin, vous pouvez ajouter un *type de pile* dans l’onglet *Paramètres* pour créer des boutons d’ajout de nœud bien pratique dans l’onglet *Arborescence*.

source: Nodes publication system
fr_fr: Système de publication des nœuds

source: During its lifecycle, every nodes can have a different publication status. When you create a new content, it will be automatically set as **Draft** by Roadiz so that you can edit it without bothering your visitors and sharing unfinished work.
fr_fr: Pendant son cycle de vie, chaque nœud peut avoir différents statuts de publication. Lorsque vous créez un nouveau contenu, il sera automatiquement publié comme **Brouillon** par Roadiz afin de vous permettre de le modifier sans incidence sur vos visiteurs et sans rendre public un contenu en cours de réalisation.

source: Available statuses:
fr_fr: Statuts disponibles :

source: **Draft**: First status for new nodes
fr_fr: **Brouillon** : statut initial pour chaque nouveau nœud

source: **Pending validation**: It’s a medium status for user that do not have permission to publish nodes
fr_fr: **En attente de validation** : un statut intermédiaire disponible pour les utilisateurs n'ayant pas les droits de publication

source: **Published**: That’s the most important status, it will set the green light to your visitor to view your content
fr_fr: **Publié** : il s'agit du statut le plus important, il rend votre contenu public aux visiteurs de votre site

source: **Archived**: When you don’t want to publish a node but you don’t want to delete it either
fr_fr: **Archivé** : lorsque vous ne souhaitez pas publier un nœud mais ne voulez pas non plus le supprimer de votre interface

source: **Deleted**: It’s the last status for your nodes. Before emptying your node trashcan, every content will wait with this status.
fr_fr: **Supprimé** : il s'agit du dernière statut disponible pour vos nœuds. Avant de vider votre corbeille, chaque nœud sera affiché avec cette mention.

source: To improve status visibility, *draft* and *pending* nodes have a rhombus shape and *published* nodes have a circle shape.
fr_fr: Pour améliorer la visibilité des statuts, les nœuds au stade de *brouillon* et *en attente de validation* sont présentés par une forme de losange alors que les nœuds *publiés* ont une forme circulaire.

source: Preview unpublished nodes
fr_fr: Prévisualiser les nœuds en attente de validation

source: As unpublished nodes are not viewable for anonymous visitors, Roadiz allows backend users to preview them using a dedicated *entry point* called ``preview.php``, yes this is not very original. We decided to create a different entry point not to share the same URL with your public website as it could create confusing errors if your website is hosted behing a reverse proxy engine.
fr_fr: Puisqu'un nœud non-publié n'est pas visible par vos visiteurs anonymes, Roadiz permet aux utilisateurs du back-office de les prévisualiser en utilisant un *chemin d'accès* appelé ``preview.php``. Nous avons décidé de créer un chemin d'accès spécifique afin de bien différencier son URL de votre site public et d'éviter ainsi erreurs et confusions si votre site est hébergé par un proxy inverse.

source: For example, if your ``my-news`` page is not published yet, connecting to ``http://mywebsite.com/my-news`` will lead to a 404 page for your anonymous visitors, as well as you too. If you want to preview it, you’ll have to connect to ``http://mywebsite.com/preview.php/my-news``. This URL will only allow authentified backend users, other people will be blocked.
fr_fr: Par exemple, si votre page ``actualités`` n'est pas encore publiée, la relier à ``http://mywebsite.com/actualites`` aboutira à une page d'erreur 404 pour tous les visiteurs anonymes ou connectés (vous compris). Cependant, si vous souhaitez la prévisualiser, vous devrez vous connecter à ``http://mywebsite.com/preview.php/actualites``. Cette URL autorisera l'accès aux visiteurs connectés au back-office uniquement, bloquant la page aux internautes anonymes.
