Repository: eliot488995568/docs
Catalog: locale/*/LC_MESSAGES/user/documents-system/intro.po
Languages: fr

source: Managing documents
fr: Gérer les documents

source: You can manage documents via the *Document* icon in the toolbar. You can either upload , embed, randomly downloaded documents, and even have a look at unused documents in your website.
fr: Vous pouvez gérer des documents via l'icône *Document* dans la barre d'outils. Vous pouvez soit téléverser, intégrer, ou télécharger au hasard des documents, ou même vérifier la liste des documents inutilisés de votre site Web.

source: Upload document
fr: Téléverser un document

source: Uploading a document has never been this easy : just drag and drop the document in the designated area.
fr: Téléverser un document n'a jamais été aussi simple : cliquez sur le document et glissez-le dans la zone concernée.

source: Embed document
fr: Intégrer un document

source: Here is the trickiest part of the Documents section. You can have embedded documents from Youtube, SoundCloud, Vimeo and Dailymotion.
fr: Il s'agit de la manipulation la plus "complexe" de la documentation. Vous pouvez intégrer des sources provenant de Youtube, SoundCloud, Mixcloud, TED, Vimeo et Dailymotion.

source: You may need to have a look at `Youtube <https://developers.google.com/youtube/v3/>`_'s and `SoundCloud <https://developers.soundcloud.com/docs>`_'s documentation, as you need an access token to have embedded documents from both of them.
fr: Il sera sans doute préférable d'aller lire la documentation `Youtube <https://developers.google.com/youtube/v3/>`_'s et `SoundCloud <https://developers.soundcloud.com/docs>`_'s puisque vous aurez besoin d'un token d'accès concernant les sources de ces deux plateformes.

source: Random document
fr: Document aléatoire

source: *Random* is a cool feature that allows to download random documents to your website from Splashbase.
fr: La fonctionnalité *Aléatoire* vous permet de télécharger des sources aléatoires sur votre site depuis la plateforme photo et vidéo Splashbase.

source: Unused document
fr: Document inutilisé

source: Clicking *Unused document* allows you to gather every unused documents on your website, so you can clean your database and get rid of useless documents.
fr: En cliquant sur *Document inutilisé*, vous pourrez vérifier la liste de toutes les sources non-référencées sur votre site, ce qui vous permettra par la suite de nettoyer votre base de données et de supprimer ainsi des fichiers inutiles.
