Repository: eliot488995568/docs
Catalog: src/locale/*/LC_MESSAGES/user/write-*-markdown/index.po
Languages: fr

source: Write in Markdown
fr: Écrire en Markdown

source: Markdown is a lightweight markup language with plain text formatting syntax designed so that it can be converted to HTML and many other formats using a tool by the same name. […] The key design goal is readability – that the language be readable as-is, without looking like it has been marked up with tags or formatting instructions, unlike text formatted with a markup language, such as Rich Text Format (RTF) or HTML, which have obvious tags and formatting instructions.
fr: Markdown est un langage de balisage léger avec une syntaxe en texte brut conçue pour être facilement traduite en HTML et bien d’autres formats. […] Le but de Markdown est de rester lisible tel quel sans donner l’impression qu’il a été marqué par des balises ou des instructions de formatage, contrairement au Rich Text Format (RTF) ou HTML qui utilisent des balises et instructions de formatage empêchant leur lecture par un(e) non-spécialiste.

source: Wikipedia article — https://en.wikipedia.org/wiki/Markdown
fr: Article sur Wikipédia — https://fr.wikipedia.org/wiki/Markdown

source: Titles
fr: Titres

source: **Add two hashtag** ``#`` **or more according to your title importance level.** Backoffice shortcut buttons allow to directly insert your titles marks before your selected text. Make sure to leave a blank line before each new title you write. ::
fr: **Ajouter deux dièses** ``#`` **ou plus en fonction de l’importance du titre souhaitée.** Les boutons du back-office permettent d’insérer directement les dièses avant le texte sélectionné. Veuillez à bien laisser une ligne vide avant chaque nouveau titre. ::

source: Be careful not to use only one hashtag to create a first-level title as this is usually used for pages main title.
fr: Attention à ne pas utiliser une seule dièse pour créer un titre de niveau 1, car il est généralement réservé au titre principal de votre page.

source: Alternate syntax
fr: Syntaxe alternative

source: Main title and second level titles can be written using ``=`` and ``-`` as underline characters. ::
fr: Les titres principaux et secondaires peuvent être écrits en les soulignant avec les caractères ``=`` et ``-``. ::

source: Bold
fr: Gras

source: **Insert two stars** ``*`` **before and after your text to set in bold.** Backoffice shortcut button allows to insert directly the 4 characters around your selected text. ::
fr: **Insérer deux étoiles** ``*`` **au début et à la fin du texte pour le mettre en gras.** Le bouton du back-office permet d’insérer directement les 4 étoiles autour du texte sélectionné. ::

source: Be careful not to leave whitespaces inside your stars group (in the same way you do with parenthesis) otherwise your text won’t be styled.
fr: Attention à ne pas laisser d’espace à l’intérieur du groupe d’étoiles (de la même manière qu’avec les parenthèses) sinon le formatage ne s’appliquera pas.

source: Italic
fr: Italique

source: **Insert one star** ``*`` **before and after your text to set in italic.** Backoffice shortcut button allows to insert directly the 2 characters around your selected text. ::
fr: **Insérer une étoile** ``*`` **au début et à la fin du texte pour le mettre en italique.** Le bouton du back-office permet d’insérer directement les 2 étoiles autour du texte sélectionné. ::

source: Bold and italic marks can of course be combined using 3 stars before and after your selected text.
fr: Les syntaxes gras et italiques peuvent bien sûr être combinées à l’aide de trois étoiles au début et à la fin du texte sélectionné.

source: What if * character is already in use
fr: Et si le caractère * est déjà utilisé dans mon texte ?

source: Bold and italic markup can be performed using ``_`` (underscore) character too if you actually need to write a *star* character in your text. ::
fr: Les gras et italique peuvent être formattés de la même manière avec le caractère tiret-bas ``_`` si votre texte contient le caractère *étoile*. ::

source: Strike-through
fr: Barré

source: **Insert two tildes** ``~`` **before and after your text to strike-through.** ::
fr: **Insérer deux tildes** ``~`` **au début et à la fin de votre texte pour le barrer.** ::

source: Ordered and unordered lists
fr: Listes ordonnées et non-ordonnées

source: **Insert a star** ``*`` **or a dash** ``-`` **followed by a single whitespace for each of your list item.** One item per line. Leave a blank line before and after your list. For *ordered* list, use a digit followed by a dot and a whitespace instead. ::
fr: **Insérer une étoile** ``*`` **ou un tiret** ``-`` **suivi d’une espace et ce, pour chaque élément de la liste.** Un élément par ligne. Laisser une ligne vide **avant et après** la liste. Pour les listes *ordonnées*, utiliser un chiffre suivi d’un point et d’une espace. ::

source: If you need to break an item into several lines, you’ll need to use the line-break markup.
fr: Si vous avez besoin de retourner à la ligne au sein d’un seul élément, vous devrez utiliser la syntaxe du retour-chariot.

source: Nested list
fr: Liste imbriquée

source: You can insert a second/third/… level for your list, just **by leaving four spaces before your new list-item mark.** ::
fr: Vous pouvez insérer un deuxième/troisième/… niveau à votre liste en **laissant quatre espaces avant chaque nouvel élément de liste.** ::

source: New paragraph and line-break
fr: Nouveau paragraphe et retour-chariot

source: A simple line-break is always ignored by Markdown language because it makes a difference between a **paragraph** and a **line-break**. To simply create a line-break without creating a new paragraph, **leave at least 3 spaces at the end of your text line then go to a new line.** ::
fr: Un simple retour à la ligne est toujours ignoré par Markdown car il fait la différence entre un **paragraphe** et un **retour-chariot** (retour à la ligne). Pour créer simplement un retour à la ligne forcé sans avoir à changer de paragraphe, **laisser au minimum 3 espaces à la fin de votre ligne de texte et aller à la ligne.** ::

source: To create a new paragraph, **always leave a blank line between your text blocks.** Any additional blank line will be ignored. ::
fr: Pour créer un nouveau paragraphe, **laisser toujours une ligne vide entre vos blocs de texte.** Tout ligne vide en plus sera ignorée. ::

source: According to your website design (CSS), new paragraphs may have no visual margins between them. Inserting more than one blank line won’t add any additional visual space as Markdown ignores it.
fr: En fonction du design (CSS) de votre site, les paragraphes peuvent ne posséder aucune marge visuelle entre eux. Insérer plus d’une ligne vide n’ajoutera pas plus d’espace car Markdown ignore les espaces et lignes superflues.

source: Hypertext links
fr: Liens hypertextes

source: **Write link label between braces immediately followed by the URL between parenthesis.** For external links do not forget protocol prefix ``http://`` or ``https://``. ::
fr: **Écrire le label du lien entre crochets suivis immédiatement de l’URL entre parenthèses.** Pour les liens externes, attention à ne pas oublier le préfixe du protocole ``http://`` ou ``https://``. ::

source: To create a internal link, just use relative notation: ::
fr: Pour un lien interne, il faut utiliser la notation relative : ::

source: Then, for an email link, use ``mailto:`` prefix: ::
fr: Pour un lien d’email, préfixer l’URL avec ``mailto:`` : ::

source: A link title can be added by inserting it before *ending parenthesis* wrapped in quotes. ::
fr: Un titre de lien peut être ajouter en l’insérant avant la parenthèse fermante, entouré de guillemets. ::

source: Block quotes
fr: Citations

source: **Insert a** ``>`` **sign before each new paragraph and a space** to wrap your text in a quote block. You can then use all other Markdown symbols inside your quote. ::
fr: **Insérer le signe** ``>`` **et une espace avant chaque nouveau paragraphe** pour inclure your texte dans une citation. Vous pourrez alors utiliser les autres symboles Markdown à l’intérieur de votre citation. ::

source: **Images use the link syntax with an exclamation mark prefix** ``!``. For external images do not forget to write full URL with protocol ``http://`` or ``https://``. ::
fr: **Les images utilisent la même syntaxe que les liens en étant préfixées par un point d’exclamation** ``!``. Pour les images externes, n’oubliez pas d’écrire l’URL complet avec protocole ``http://`` ou ``https://``. ::

source: Be careful, images will be displayed as is, unless your webdesigner planned to adapt image size coming from Markdown fields using CSS. As links, an external image may break if its owner deletes the original image. Make sure to host critical images directly on your website and to use *relative URL*.
fr: Attention, les images seront affichées à leur dimension et qualité natives, à moins que votre webdesigner n’ait prévu d’adapter les images provenant d’un champ Markdown via CSS. Comme pour les liens, les images externes peuvent casser si leur propriétaire supprime la ressource originale. Faites attention à toujours héberger vous-même les images importantes de votre site-web et d’utiliser des *liens relatifs*.

source: Footnotes
fr: Notes de bas de page

source: Footnotes are not supported with *basic* Markdown syntax, but the *Markdown Extra* one. So before using them, **make sure your webdesigner used the right Markdown parser in your theme.** ::
fr: Les notes de bas de page ne sont pas prises en charge par la version basique de Markdown mais par la version *MarkdownExtra*. Ainsi, **vérifiez que votre webdesigner a bien utilisé le bon formateur Markdown dans votre thème.** ::

source: Markdown will *automatically generate anchor links between your footnote and its reference*. It will automatically **use numbers as footnote reference labels**, so you don’t have to bother to write numbers yourself but easy-to-remember markers labels.
fr: Markdown *générera automatiquement les liens d’ancre entre vos notes de bas de page et leur références.* Il **utilisera automatiquement des numéros pour les appels de notes**, vous n’avez du coup pas besoin de vous embêter à les numéroter manuellement, juste à les nommer de manière à bien les repérer.
